# Path Reinforcement Primary Bar Shape Id Property

Source: https://www.revitapidocs.com/2026/06e0653f-9e58-c180-67b3-cbdd74f2d345.htm

---

| Path Reinforcement Primary Bar Shape Id Property |
| --- |

The RebarShape element that defines the shape of the primary bars of the Path Reinforcement.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId PrimaryBarShapeId { get; set; }
```

```
Public Property PrimaryBarShapeId As ElementId
	Get
	Set
```

```
public:
property ElementId^ PrimaryBarShapeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

```
member PrimaryBarShapeId : ElementId with get, set
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: shapeId should refer to two dimensional Rebar Shape element with segments forming only right angles,  or the Rebar Shape has at least one end treatment or it has at least one crank. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |
| InvalidOperationException | When setting this property: This PathReinforcement does not host Rebar. |

Remarks Changing the value of this property causes the Path Reinforcement to choose values for its
 shape parameters. See Also

#### Reference

PathReinforcement Class Autodesk.Revit.DB.Structure Namespace